{"id": "arxiv:2509.17018v1:summary", "paper_id": "arxiv:2509.17018v1", "section": "Summary", "page_from": 0, "page_to": 0, "text": "We propose a machine learning (ML) architecture to better capture the\ndependency of thermodynamic properties on the independent states. When\npredicting state-dependent thermodynamic properties, ML models need to account\nfor both molecular structure and the thermodynamic state, described by\nindependent variables, typically temperature, pressure, and composition. Modern\nmolecular ML models typically include state information by adding it to\nmolecular fingerprint vectors or by embedding explicit (semi-empirical)\nthermodynamic relations. Here, we propose to rather split the information\nprocessing on the molecular structure and the dependency on states into two\nseparate network channels: a graph neural network and a multilayer perceptron,\nwhose output is combined by a dot product. We refer to our approach as\nDeepEOSNet, as this idea is based on the DeepONet architecture [Lu et al.\n(2021), Nat. Mach. Intell.]: instead of operators, we learn state dependencies,\nwith the possibility to predict equation of states (EOS). We investigate the\npredictive performance of DeepEOSNet by means of three case studies, which\ninclude the prediction of vapor pressure as a function of temperature, and\nmixture molar volume as a function of composition, temperature, and pressure.\nOur results show superior performance of DeepEOSNet for predicting vapor\npressure and comparable performance for predicting mixture molar volume\ncompared to state-of-research graph-based thermodynamic prediction models from\nour earlier works. In fact, we see large potential of DeepEOSNet in cases where\ndata is sparse in the state domain and the output function is structurally\nsimilar across different molecules. The concept of DeepEOSNet can easily be\ntransferred to other ML architectures in molecular context, and thus provides a\nviable option for property prediction."}
