{"id": "arxiv:2510.11714v1:summary", "paper_id": "arxiv:2510.11714v1", "section": "Summary", "page_from": 0, "page_to": 0, "text": "This article establishes a stochastic homogenization result for the first\norder Hamilton-Jacobi equation on a Riemannian manifold $M$, in the context of\na stationary ergodic random environment. The setting involves a finitely\ngenerated abelian group $ \\mathtt{G}$ of rank $b$ acting on $M$ by isometries\nin a free, totally discontinuous, and co-compact manner, and a family of\nHamiltonians $H: T^*M \\times \\Omega \\to \\mathbb{R}$, parametrized over a\nprobability space $(\\Omega, \\mathbb{P})$, which are stationary with respect to\na $\\mathbb{P}$-ergodic action of $\\mathtt{G}$ on $\\Omega$. Under standard\nassumptions, including strict convexity and coercivity in the momentum\nvariable, we prove that as the scaling parameter $\\varepsilon$ goes to $0$, the\nviscosity solutions to the rescaled equation converge almost surely and locally\nuniformly to the solution to a deterministic homogenized Hamilton-Jacobi\nequation posed on $\\mathbb{R}^b$, which corresponds to the asymptotic cone of\n$\\mathtt{G}$. In particular, this approach sheds light on the relation between\nthe limit problem, the limit space, and the complexity of the acting group. The\nclassical periodic case corresponds to a randomness set $\\Omega$ that reduces\nto a singleton; other interesting examples of this setting are also described.\n  We remark that the effective Hamiltonian $\\overline{H}$ is obtained as the\nconvex conjugate of an effective Lagrangian $\\overline{L}$, which generalizes\nMather's $\\beta$-function to the stochastic setting; this represents a first\nstep towards the development of a stationary-ergodic version of Aubry-Mather\ntheory. As a geometric application, we introduce a notion of stable-like norm\nfor stationary ergodic families of Riemannian metrics on $M$, which generalizes\nthe classical Federer-Gromov's stable norm for closed manifolds."}
