{"id": "arxiv:2510.11716v1:summary", "paper_id": "arxiv:2510.11716v1", "section": "Summary", "page_from": 0, "page_to": 0, "text": "Meson-antimeson transitions are flavor-changing neutral current processes in\nwhich the strangeness, charm, or beauty quantum number changes by two units. In\nthe Standard Model (SM) these transitions originate from box diagrams with two\nW bosons. They permit the preparation of time-dependent, oscillating quantum\nstates which are superpositions of a meson and its antimeson. By studying their\ndecays one gains information on both the meson-antimeson mixing amplitude and\nthe decay amplitude involved and one can measure complex phases quantifying the\nviolation of charge-parity (CP) violation. I present a comprehensive overview\non the topic, starting with phenomenological presentations of $K$-$\\bar K$,\n$B_d$-$\\bar B_d$, $B_s$-$\\bar B_s$, and $D$-$\\bar D$ mixing. Highlights are the\ndiscovery of the violation of CP and other discrete symmetries, the predictions\nof the charm quark and its mass and a heavy top quark, and the confirmation of\nthe Kobayashi-Maskawa mechanism of CP violation. Further sections cover the\ntheoretical formalism needed to describe meson-antimeson mixing and to\ncalculate observables in terms of the fundamental parameters of the SM. I\ndiscuss the unitarity triangle of the Cabibbo-Kobayashi-Maskawa matrix, which\nis used to visualize how various CP-violating and CP-conserving quantities\ncombine to probe the SM. I describe the emergence of precision flavor physics\nand the role of reliable theory calculations to link $K$-$\\bar K$ mixing to\n$B_d$-$\\bar B_d$ mixing, which was essential to confirm the Kobayashi-Maskawa\nmechanism, and present the current status of theory predictions. Today, the\nfocus of the field is on physics beyond the SM, because meson-antimeson mixing\namplitudes are sensitive to virtual effects of heavy particles with masses\nwhich are several orders of magnitude above the reach of current particle\ncolliders."}
